{"name":"input","status":"living","summary":"The `<input>` HTML element is used to create interactive controls for web-based forms in order to accept data from the user; a wide variety of types of input data and control widgets are available, depending on the device and user agent. The `<input>` element is one of the most powerful and complex in all of HTML due to the sheer number of combinations of input types and attributes.","url":"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/input","type":"element","scope":"HTML","tags":["Data entry","Forms","HTML","HTML forms","HTML input tag","MakeBrowserAgnostic"],"interfaces":["HTMLInputElement","HTMLElement","Element"],"namespace":"http://www.w3.org/1999/xhtml","contentCategories":"Flow content, listed, submittable, resettable, form-associated element, phrasing content. If the type is not hidden, then labelable element, palpable content.","permittedContent":"None, it is an empty element.","tagOmission":"Must have a start tag and must not have an end tag.","permittedParents":"Any element that accepts phrasing content.","implicitAriaRole":"type=button: button type=checkbox: checkbox type=email with no list attribute: textbox with list attribute: combobox type=image: button type=number: spinbutton type=radio: radio type=range: slider type=reset: button type=search with no list attribute: searchbox with list attribute:combobox type=submit: button type=tel with no list attribute: textbox with list attribute: combobox type=text with no list attribute: textbox with list attribute: combobox type=url with no list attribute: textbox with list attribute: combobox type=color|date|datetime-local|file|hidden|month|password|time|week: no corresponding role","permittedAriaRoles":"type=button: link, menuitem, menuitemcheckbox, menuitemradio, option, radio, switch, tab type=checkbox: button when used with aria-pressed, menuitemcheckbox, option, switch type=image: link, menuitem, menuitemcheckbox, menuitemradio, radio, switch type=radio: menuitemradio type=text with no list attribute: combobox, searchbox, spinbutton type=color|date|datetime-local|email|file|hidden| month|number|password|range|reset|search|submit|tel|url|week or text with list attribute: no role permitted","globalAttributes":"https://mdn-element-api.netlify.com/html/_global-attributes.json","attributes":{}}
