{"name":"li","status":"living","summary":"The `<li>` HTML element is used to represent an item in a list. It must be contained in a parent element: an ordered list (ol), an unordered list (ul), or a menu (menu). In menus and unordered lists, list items are usually displayed using bullet points. In ordered lists, they are usually displayed with an ascending counter on the left, such as a number or letter.","url":"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/li","type":"element","scope":"HTML","tags":["HTML","HTML grouping content"],"interfaces":["HTMLLIElement","HTMLElement","Element"],"namespace":"http://www.w3.org/1999/xhtml","contentCategories":"None.","permittedContent":"Flow content.","tagOmission":"The end tag can be omitted if the list item is immediately followed by another li element, or if there is no more content in its parent element.","permittedParents":"An ul, ol, or menu element. Though not a conforming usage, the obsolete dir can also be a parent.","implicitAriaRole":"listitem when child of an ol, ul or menu","permittedAriaRoles":"menuitem, menuitemcheckbox, menuitemradio, option, none, presentation, radio, separator, tab, treeitem","globalAttributes":"https://mdn-element-api.netlify.com/html/_global-attributes.json","attributes":{"value":{"name":"value","status":"living","summary":"This integer attribute indicates the current ordinal value of the list item as defined by the ol element. The only allowed value for this attribute is a number, even if the list is displayed with Roman numerals or letters. List items that follow this one continue numbering from the value set. The value attribute has no meaning for unordered lists (ul) or for menus (menu).","url":"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/li","type":"attribute","scope":"HTML:li","tags":[]},"type":{"name":"type","status":"deprecated","summary":"This character attribute indicates the numbering type.","url":"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/li","type":"attribute","scope":"HTML:li","tags":[]}}}
